dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
// USB GDB Remote Protocol stub - the DEBUG submodule of TaichiUSB (see
// TaichiUsb.h). I/O is wired to the maintenance/service CDC only (the nrfUsbd
// device-core path), using TaichiUSB's stub-halted service hooks so debug keeps
// flowing while the target is halted. User Sketch Serial uses the separate user
// CDC when enabled.
#include "NrfGdbStub.h"

#include <string.h>

#include "NrfSystem.h"
#include "NrfUsbd.h"
#include "USBDevice.h"

extern "C" {
uint32_t nrf_gdb_stub_callee_regs[8] = {0};
}

namespace {
// ARMv7-M System Control Block / Debug Control Block registers.
constexpr uint32_t DEMCR = 0xE000EDFCUL;
constexpr uint32_t DEMCR_MON_EN = 0x00010000UL;   // Bit 16: enable DebugMon exception.
constexpr uint32_t DEMCR_MON_PEND = 0x00020000UL; // Bit 17: pend a DebugMon exception (async halt).
constexpr uint32_t DEMCR_MON_STEP = 0x00040000UL; // Bit 18: step a single instruction after exit.
constexpr uint32_t DEMCR_TRCENA = 0x01000000UL;   // Bit 24: enable DWT/FPB tracing block.

// Cortex-M4 Data Watchpoint and Trace unit. 4 comparators on nRF52840; we use
// them for GDB's data watchpoints (Z2/Z3/Z4). Each comparator is COMP/MASK/
// FUNCTION at a 16-byte stride. FUNCTION.FUNCTION: 5=read, 6=write, 7=access;
// bit 24 (MATCHED) reads 1 (and self-clears) when that comparator tripped.
constexpr uint32_t DWT_COMP_BASE = 0xE0001020UL;
constexpr uint32_t DWT_COMP_STRIDE = 16UL;
constexpr uint32_t DWT_FUNCTION_MATCHED = 0x01000000UL;
constexpr uint32_t DFSR_DWTTRAP = 0x00000004UL;   // DFSR bit 2: a DWT debug event occurred.

// Vector Table Offset Register; [VTOR]=initial SP, [VTOR+4]=reset handler.
constexpr uint32_t VTOR = 0xE000ED08UL;
// Cortex-M3/M4 implement up to 6 FPB code comparators and 4 DWT comparators.
constexpr uint32_t SHCSR = 0xE000ED24UL;
constexpr uint32_t SHCSR_MEMFAULTENA = 0x00010000UL;
constexpr uint32_t SHCSR_BUSFAULTENA = 0x00020000UL;
constexpr uint32_t SHCSR_USGFAULTENA = 0x00040000UL;
constexpr uint32_t CFSR = 0xE000ED28UL;
constexpr uint32_t HFSR = 0xE000ED2CUL;
constexpr uint32_t DFSR = 0xE000ED30UL;
constexpr uint32_t DFSR_HALTED = 0x00000001UL;    // Halt request (BKPT or step).
constexpr uint32_t DFSR_BKPT = 0x00000002UL;      // BKPT or FPB instruction match.

// System Handler Priority Register 3. Byte 0 holds the DebugMon (exc 12)
// priority. We pin it to 0 (highest configurable) so that during a single step
// we can raise BASEPRI to mask the application's interrupts while DebugMon
// itself is still allowed to fire -- otherwise `stepi` steps into whatever ISR
// (e.g. SysTick at prio 0xE0) happens to be pending instead of the user's code.
constexpr uint32_t SHPR3 = 0xE000ED20UL;
// nRF52840 implements 3 NVIC priority bits, so priorities live in the top 3
// bits: 0x00,0x20,...,0xE0. BASEPRI=0x20 masks every interrupt of priority
// >=0x20 (SysTick/RTC1/...) while leaving priority-0 handlers -- the pinned
// DebugMon -- able to preempt and complete the step. (USBD is prio 0 but stays
// NVIC-masked across the halt.)
constexpr uint32_t STEP_BASEPRI = 0x20UL;

inline void setBasepri(uint32_t value) {
    __asm__ volatile("msr basepri, %0" : : "r"(value) : "memory");
}

// Cortex-M Flash Patch and Breakpoint unit. Provides up to 6 instruction
// comparators that halt the CPU into DebugMon_Handler when PC matches a flash
// address. We use this for GDB's Z0 packet so we never have to NVMC-erase
// pages just to plant a BKPT into running code.
constexpr uint32_t FP_CTRL = 0xE0002000UL;
constexpr uint32_t FP_CTRL_ENABLE = 0x00000001UL;
constexpr uint32_t FP_CTRL_KEY = 0x00000002UL;    // Required for any FP_CTRL write.
constexpr uint32_t FP_COMP_BASE = 0xE0002008UL;
constexpr uint32_t FP_COMP_ENABLE = 0x00000001UL;
constexpr uint32_t FP_COMP_REPLACE_LO = 0x40000000UL; // Match on 4-byte-aligned PC.
constexpr uint32_t FP_COMP_REPLACE_HI = 0x80000000UL; // Match on +2-aligned half-word.
constexpr uint32_t FP_COMP_ADDR_MASK = 0x1FFFFFFCUL;

// NVIC interrupt set/clear-enable registers. We only need to mask USBD_IRQ
// (number 39 on nRF52840) so the stub can poll the USB controller without
// racing the ISR. Bit (irq mod 32) of register (irq / 32).
constexpr uint32_t NVIC_ISER_BASE = 0xE000E100UL;
constexpr uint32_t NVIC_ICER_BASE = 0xE000E180UL;
constexpr uint32_t USBD_NVIC_IRQ = 39UL;
constexpr uint32_t USBD_NVIC_REG_OFFSET = (USBD_NVIC_IRQ / 32U) * 4U;
constexpr uint32_t USBD_NVIC_BIT = 1UL << (USBD_NVIC_IRQ % 32U);
constexpr uint32_t POWER_BASE = 0x40000000UL;
constexpr uint32_t POWER_GPREGRET = 0x51CUL;

// Hardware watchdog (WDT). A sketch may arm it before hitting a breakpoint
// (the UsbGdbStubBreakpoint example does, as a brick-recovery safety). Once
// started the WDT cannot be stopped, so while the stub is halted waiting for /
// talking to GDB we must reload it or the board resets out from under the
// debug session after the timeout. RREN enables RR0 only; writing the reload
// magic to RR0 kicks it. Harmless no-op when the WDT isn't running.
constexpr uint32_t WDT_BASE = 0x40010000UL;
constexpr uint32_t WDT_RUNSTATUS = 0x400UL;
constexpr uint32_t WDT_RR0 = 0x600UL;
constexpr uint32_t WDT_RELOAD_MAGIC = 0x6E524635UL;
constexpr uint32_t ARM_FLASH_END = 0x00100000UL;
constexpr uint32_t ARM_SRAM_BASE = 0x20000000UL;
constexpr uint32_t ARM_SRAM_END = 0x20040000UL;
constexpr size_t PACKET_CAPACITY = 256U;
constexpr size_t REPLY_CAPACITY = 384U;
constexpr uint8_t GDB_BREADCRUMB_BASE = 0xA0U;
constexpr uint8_t GDB_BREADCRUMB_EXCEPTION = 0xA1U;
constexpr uint8_t GDB_BREADCRUMB_INIT = 0xA2U;
constexpr uint8_t GDB_BREADCRUMB_CAPTURE = 0xA3U;
constexpr uint8_t GDB_BREADCRUMB_SERVE = 0xA4U;
constexpr uint8_t GDB_BREADCRUMB_STOP = 0xA5U;
constexpr uint8_t GDB_BREADCRUMB_PACKET = 0xA6U;
constexpr uint8_t GDB_BREADCRUMB_REPLY = 0xA7U;
constexpr uint32_t GDB_USB_REENUMERATION_SPINS = 3200000UL;

inline volatile uint32_t &mem32(uint32_t address) {
    return *reinterpret_cast<volatile uint32_t *>(address);
}

// Reload the hardware watchdog if (and only if) it is running, so a sketch
// that armed the WDT before a breakpoint doesn't reset the board while the
// stub is halted waiting for or servicing GDB.
inline void feedWatchdogIfRunning() {
    if (*reinterpret_cast<volatile uint32_t *>(WDT_BASE + WDT_RUNSTATUS) != 0UL) {
        *reinterpret_cast<volatile uint32_t *>(WDT_BASE + WDT_RR0) = WDT_RELOAD_MAGIC;
    }
}

inline volatile uint32_t &powerReg32(uint32_t offset) {
    return *reinterpret_cast<volatile uint32_t *>(POWER_BASE + offset);
}

bool ownsBreadcrumb(uint8_t value) {
    return (value & 0xF0U) == GDB_BREADCRUMB_BASE;
}

void writeBreadcrumb(uint8_t value) {
    powerReg32(POWER_GPREGRET) = value;
}

