dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
uint8_t readBreadcrumb() {
    return static_cast<uint8_t>(powerReg32(POWER_GPREGRET) & 0xFFU);
}

void clearBreadcrumb() {
    if (ownsBreadcrumb(readBreadcrumb())) {
        powerReg32(POWER_GPREGRET) = 0U;
    }
}

inline uint8_t toHex(uint8_t value) {
    if (value < 10U) {
        return static_cast<uint8_t>('0' + value);
    }
    return static_cast<uint8_t>('a' + (value - 10U));
}

int fromHex(int value) {
    if (value >= '0' && value <= '9') {
        return value - '0';
    }
    if (value >= 'a' && value <= 'f') {
        return value - 'a' + 10;
    }
    if (value >= 'A' && value <= 'F') {
        return value - 'A' + 10;
    }
    return -1;
}

void appendChar(char *buffer, size_t capacity, size_t &length, char value) {
    if (length + 1U >= capacity) {
        return;
    }
    buffer[length++] = value;
    buffer[length] = '\0';
}

void appendText(char *buffer, size_t capacity, size_t &length, const char *text) {
    if (text == nullptr) {
        return;
    }
    while (*text != '\0' && length + 1U < capacity) {
        buffer[length++] = *text++;
    }
    buffer[length] = '\0';
}

void appendByte(char *buffer, size_t capacity, size_t &length, uint8_t value) {
    appendChar(buffer, capacity, length, static_cast<char>(toHex(static_cast<uint8_t>(value >> 4U))));
    appendChar(buffer, capacity, length, static_cast<char>(toHex(static_cast<uint8_t>(value & 0x0FU))));
}

void appendWord(char *buffer, size_t capacity, size_t &length, uint32_t value) {
    for (size_t index = 0; index < 4U; ++index) {
        appendByte(buffer, capacity, length, static_cast<uint8_t>((value >> (index * 8U)) & 0xFFU));
    }
}

uint32_t parseHexWord(const char *text, bool &ok) {
    ok = false;
    if (text == nullptr || *text == '\0') {
        return 0UL;
    }

    uint32_t value = 0UL;
    while (*text != '\0') {
        const int nibble = fromHex(*text++);
        if (nibble < 0) {
            return 0UL;
        }
        value = static_cast<uint32_t>((value << 4U) | static_cast<uint32_t>(nibble));
    }
    ok = true;
    return value;
}

bool splitMemoryRequest(char *packet, uint32_t &address, uint32_t &length) {
    char *comma = nullptr;
    for (char *cursor = packet; *cursor != '\0'; ++cursor) {
        if (*cursor == ',') {
            comma = cursor;
            break;
        }
    }
    if (comma == nullptr) {
        return false;
    }

    *comma = '\0';
    bool okAddress = false;
    bool okLength = false;
    address = parseHexWord(packet, okAddress);
    length = parseHexWord(comma + 1, okLength);
    return okAddress && okLength;
}

bool memoryReadable(uint32_t address, uint32_t length) {
    const uint64_t end = static_cast<uint64_t>(address) + static_cast<uint64_t>(length);
    if (end < address) {
        return false;
    }
    if (address < ARM_FLASH_END && end <= ARM_FLASH_END) {
        return true;
    }
    if (address >= ARM_SRAM_BASE && end <= ARM_SRAM_END) {
        return true;
    }
    // FICR/UICR device-info pages (0x10000000-0x10001000).
    if (address >= 0x10000000UL && end <= 0x10002000UL) {
        return true;
    }
    // Peripheral register space (0x40000000-0x60000000) for cortex-debug's
    // Peripherals/SVD pane, plus the PPB/system block (0xE0000000-0xE0100000:
    // SCB, NVIC, DWT, FPB...). NOTE: a few peripheral regs have read side
    // effects (EVENTS_*, FIFO pops); the debugger only reads what the SVD/user
    // requests, so this is acceptable for a debug build.
    if (address >= 0x40000000UL && end <= 0x60000000UL) {
        return true;
    }
    if (address >= 0xE0000000UL && end <= 0xE0100000UL) {
        return true;
    }
    return false;
}

bool isFaultException(uint32_t exceptionNumber) {
    return exceptionNumber == 3UL || exceptionNumber == 4UL || exceptionNumber == 5UL || exceptionNumber == 6UL;
}

bool parseRegisterBytes(const char *text, uint32_t &value) {
    if (text == nullptr) {
        return false;
    }

    value = 0UL;
    for (size_t index = 0; index < 4U; ++index) {
        const int high = fromHex(text[index * 2U]);
        const int low = fromHex(text[index * 2U + 1U]);
        if (high < 0 || low < 0) {
            return false;
        }
        const uint8_t byteValue = static_cast<uint8_t>((high << 4U) | low);
        value |= static_cast<uint32_t>(byteValue) << (index * 8U);
    }
    return true;
}

bool setRegByIndex(NrfGdbRegs &regs, uint32_t index, uint32_t value) {
    switch (index) {
        case 0UL:
            regs.r0 = value;
            return true;
        case 1UL:
            regs.r1 = value;
            return true;
        case 2UL:
            regs.r2 = value;
            return true;
        case 3UL:
            regs.r3 = value;
            return true;
        case 4UL:
            regs.r4 = value;
            return true;
        case 5UL:
            regs.r5 = value;
            return true;
        case 6UL:
            regs.r6 = value;
            return true;
        case 7UL:
            regs.r7 = value;
            return true;
        case 8UL:
            regs.r8 = value;
            return true;
        case 9UL:
            regs.r9 = value;
            return true;
        case 10UL:
            regs.r10 = value;
            return true;
        case 11UL:
            regs.r11 = value;
            return true;
        case 12UL:
            regs.r12 = value;
            return true;
        case 13UL:
            return value == regs.sp;
        case 14UL:
            regs.lr = value;
            return true;
        case 15UL:
            regs.pc = value;
            return true;
        case 25UL:
            regs.xpsr = value;
            return true;
        default:
            return false;
    }
}

uint32_t thumbInstructionSize(uint32_t pc) {
    const uint32_t address = pc & ~1UL;
    if (!memoryReadable(address, 2UL)) {
        return 2UL;
    }

    const uint16_t opcode = *reinterpret_cast<const uint16_t *>(address);
    if ((opcode & 0xF800U) == 0xE800U || (opcode & 0xF000U) == 0xF000U) {
        return 4UL;
    }
    return 2UL;
}

