dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
uint8_t signalForException(uint32_t exceptionNumber) {
    switch (exceptionNumber) {
        case 4UL:
            return 11U;
        case 5UL:
            return 10U;
        case 6UL:
            return 4U;
        case 12UL:
            return 5U;
        case 3UL:
        default:
            return 11U;
    }
}

const uint32_t *regByIndex(const NrfGdbRegs &regs, uint32_t index) {
    switch (index) {
        case 0UL:
            return &regs.r0;
        case 1UL:
            return &regs.r1;
        case 2UL:
            return &regs.r2;
        case 3UL:
            return &regs.r3;
        case 4UL:
            return &regs.r4;
        case 5UL:
            return &regs.r5;
        case 6UL:
            return &regs.r6;
        case 7UL:
            return &regs.r7;
        case 8UL:
            return &regs.r8;
        case 9UL:
            return &regs.r9;
        case 10UL:
            return &regs.r10;
        case 11UL:
            return &regs.r11;
        case 12UL:
            return &regs.r12;
        case 13UL:
            return &regs.sp;
        case 14UL:
            return &regs.lr;
        case 15UL:
            return &regs.pc;
        case 25UL:
            return &regs.xpsr;
        default:
            return nullptr;
    }
}
}

NrfGdbStubClass &nrfGdbStub() {
    static NrfGdbStubClass stub;
    return stub;
}

uint8_t nrfGdbStubBreadcrumb() {
    const uint8_t value = readBreadcrumb();
    if (ownsBreadcrumb(value)) {
        return value;
    }
    return 0U;
}

void nrfGdbStubClearBreadcrumb() {
    clearBreadcrumb();
}

void NrfGdbStubClass::init() {
    if (initialized_ || !enabled()) {
        return;
    }

    nrfUsbdDriver().end();
    for (volatile uint32_t spin = 0UL; spin < GDB_USB_REENUMERATION_SPINS; ++spin) {
        __asm__ volatile("nop");
    }
    USBDevice.init();
    USBDevice.attach();
    // TRCENA must be set before any FPB/DWT register write.
    mem32(DEMCR) |= DEMCR_TRCENA | DEMCR_MON_EN;
    mem32(SHCSR) |= SHCSR_MEMFAULTENA | SHCSR_BUSFAULTENA | SHCSR_USGFAULTENA;
    // Pin DebugMon to the highest configurable priority so a step-time BASEPRI
    // raise can mask the application's interrupts without masking DebugMon.
    mem32(SHPR3) &= ~0x000000FFUL;
    fpbInitOnce();
    dwtInitOnce();
    initialized_ = true;
    writeBreadcrumb(GDB_BREADCRUMB_INIT);
}

void NrfGdbStubClass::fpbInitOnce() {
    if (fpbReady_) {
        return;
    }
    // Enable the FPB unit. The KEY bit must be set on every write to FP_CTRL.
    mem32(FP_CTRL) = FP_CTRL_KEY | FP_CTRL_ENABLE;
    for (size_t index = 0; index < kFpbMaxSlots; ++index) {
        mem32(FP_COMP_BASE + (index * 4U)) = 0UL;
        fpbSlots_[index].inUse = false;
        fpbSlots_[index].address = 0UL;
    }
    fpbReady_ = true;
}

bool NrfGdbStubClass::fpbInsert(uint32_t address) {
    fpbInitOnce();
    // FPB only acts on flash (code) addresses. RAM-resident code would need
    // an actual BKPT byte patched in, which we don't support today.
    const uint32_t bare = address & ~1UL;
    if (bare >= ARM_FLASH_END) {
        return false;
    }
    // Reuse an existing slot if this address is already armed.
    for (size_t index = 0; index < kFpbMaxSlots; ++index) {
        if (fpbSlots_[index].inUse && fpbSlots_[index].address == bare) {
            return true;
        }
    }
    for (size_t index = 0; index < kFpbMaxSlots; ++index) {
        if (fpbSlots_[index].inUse) {
            continue;
        }
        const uint32_t replace = (bare & 0x2UL) ? FP_COMP_REPLACE_HI : FP_COMP_REPLACE_LO;
        mem32(FP_COMP_BASE + (index * 4U)) = replace | (bare & FP_COMP_ADDR_MASK) | FP_COMP_ENABLE;
        fpbSlots_[index].inUse = true;
        fpbSlots_[index].address = bare;
        return true;
    }
    return false; // All 6 comparators are in use.
}

bool NrfGdbStubClass::fpbRemove(uint32_t address) {
    const uint32_t bare = address & ~1UL;
    for (size_t index = 0; index < kFpbMaxSlots; ++index) {
        if (fpbSlots_[index].inUse && fpbSlots_[index].address == bare) {
            mem32(FP_COMP_BASE + (index * 4U)) = 0UL;
            fpbSlots_[index].inUse = false;
            fpbSlots_[index].address = 0UL;
            return true;
        }
    }
    return false;
}

void NrfGdbStubClass::fpbDisableAll() {
    for (size_t index = 0; index < kFpbMaxSlots; ++index) {
        mem32(FP_COMP_BASE + (index * 4U)) = 0UL;
        fpbSlots_[index].inUse = false;
        fpbSlots_[index].address = 0UL;
    }
}

void NrfGdbStubClass::enableMonStep() {
    mem32(DEMCR) |= DEMCR_MON_STEP;
}

void NrfGdbStubClass::disableMonStep() {
    mem32(DEMCR) &= ~DEMCR_MON_STEP;
}

void NrfGdbStubClass::dwtInitOnce() {
    if (dwtReady_) {
        return;
    }
    // TRCENA (set in init()) must already be on for DWT writes to stick.
    for (size_t index = 0; index < kDwtMaxSlots; ++index) {
        const uint32_t base = DWT_COMP_BASE + (index * DWT_COMP_STRIDE);
        mem32(base + 8U) = 0UL; // FUNCTION = 0 -> comparator disabled
        dwtSlots_[index].inUse = false;
        dwtSlots_[index].address = 0UL;
        dwtSlots_[index].function = 0U;
    }
    dwtReady_ = true;
}

bool NrfGdbStubClass::dwtInsert(uint32_t function, uint32_t address, uint32_t kind) {
    dwtInitOnce();
    // kind is the watch length in bytes (1/2/4). DWT MASK ignores the low
    // log2(kind) address bits so the whole object is covered.
    uint32_t mask = 0UL;
    if (kind == 2UL) {
        mask = 1UL;
    } else if (kind == 4UL) {
        mask = 2UL;
    } else if (kind != 1UL) {
        return false; // only byte/halfword/word watchpoints
    }
    // Reuse a slot already watching this address+function.
    for (size_t index = 0; index < kDwtMaxSlots; ++index) {
        if (dwtSlots_[index].inUse && dwtSlots_[index].address == address &&
            dwtSlots_[index].function == function) {
            return true;
        }
    }
    for (size_t index = 0; index < kDwtMaxSlots; ++index) {
        if (dwtSlots_[index].inUse) {
            continue;
        }
        const uint32_t base = DWT_COMP_BASE + (index * DWT_COMP_STRIDE);
        mem32(base + 0U) = address;       // COMP
        mem32(base + 4U) = mask;          // MASK
        mem32(base + 8U) = function;      // FUNCTION (5 read / 6 write / 7 access)
        dwtSlots_[index].inUse = true;
        dwtSlots_[index].address = address;
        dwtSlots_[index].function = static_cast<uint8_t>(function);
        return true;
    }
    return false; // all 4 comparators in use
}

