dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
bool NrfGdbStubClass::dwtRemove(uint32_t function, uint32_t address) {
    for (size_t index = 0; index < kDwtMaxSlots; ++index) {
        if (dwtSlots_[index].inUse && dwtSlots_[index].address == address &&
            dwtSlots_[index].function == function) {
            mem32(DWT_COMP_BASE + (index * DWT_COMP_STRIDE) + 8U) = 0UL;
            dwtSlots_[index].inUse = false;
            dwtSlots_[index].address = 0UL;
            dwtSlots_[index].function = 0U;
            return true;
        }
    }
    return false;
}

void NrfGdbStubClass::dwtDisableAll() {
    for (size_t index = 0; index < kDwtMaxSlots; ++index) {
        mem32(DWT_COMP_BASE + (index * DWT_COMP_STRIDE) + 8U) = 0UL;
        dwtSlots_[index].inUse = false;
        dwtSlots_[index].address = 0UL;
        dwtSlots_[index].function = 0U;
    }
}

bool NrfGdbStubClass::detectWatchpointHit() {
    watchHit_ = false;
    if ((mem32(DFSR) & DFSR_DWTTRAP) == 0UL) {
        return false;
    }
    for (size_t index = 0; index < kDwtMaxSlots; ++index) {
        if (!dwtSlots_[index].inUse) {
            continue;
        }
        const uint32_t base = DWT_COMP_BASE + (index * DWT_COMP_STRIDE);
        if ((mem32(base + 8U) & DWT_FUNCTION_MATCHED) != 0UL) {
            watchHit_ = true;
            watchHitAddr_ = dwtSlots_[index].address;
            // gdb stop-reply keyword by access type: read->rwatch, write->watch,
            // access->awatch (FUNCTION 5/6/7 respectively).
            const uint8_t fn = dwtSlots_[index].function;
            watchHitKind_ = (fn == 6U) ? 'w' : (fn == 5U) ? 'r' : 'a';
            return true;
        }
    }
    return false;
}

void NrfGdbStubClass::serviceAsyncBreak() {
    // Called from yield() while the target runs free. A 0x03 is both the
    // initial attach request injected by the USB bridge and GDB's later Pause
    // request. Requiring sessionLive_ here made the first attach impossible:
    // sessionLive_ is established only after serve() has handled that first
    // stop. The dedicated service CDC is not user data, so accepting the
    // initial break is safe before a session has been marked live.
    if (active_ || !enabled()) {
        return;
    }
    // During free-run nothing else fetches the service-CDC OUT endpoint (its
    // bit-gated drain lives in the stub's halted poll), so the host's byte
    // would sit unfetched in the EP buffer and the next packet would NAK. Pump
    // the drain here to pull any host OUT into the rx ring. Safe in free-run:
    // The halted stub masks the USB ISR and runs in thread context.
    nrfUsbdDriver().drainServiceDataOut();
    // A host async-interrupt arrives as a bare 0x03 byte (no $..# framing). In
    // all-stop mode (what gdb/cortex-debug use) the host sends nothing else
    // while the target runs except acks, so drain-and-scan the whole rx ring:
    // consume every byte and halt if any is 0x03. (A stale/ack byte at the ring
    // head must not block the 0x03 behind it.)
    bool sawBreak = false;
    while (true) {
        const int b = nrfUsbdDriver().read();
        if (b < 0) {
            break; // ring drained
        }
        if (b == 0x03) {
            sawBreak = true;
            break;
        }
    }
    if (!sawBreak) {
        return;
    }
    pendingAsyncBreak_ = true;
    // Pend a DebugMon exception; it fires immediately (prio 0) and halts us.
    mem32(DEMCR) |= DEMCR_MON_PEND;
}

void NrfGdbStubClass::performWarmRestart() {
    // Re-point SP/PC at the application's reset vector so the next resume
    // re-runs C startup (copies .data, zeroes .bss, calls SystemInit + main ->
    // setup()). VTOR currently points at the app table (0x1000 on this board).
    const uint32_t vtor = mem32(VTOR);
    const uint32_t initialSp = mem32(vtor + 0U);
    const uint32_t resetVec = mem32(vtor + 4U);
    regs_.sp = initialSp;
    regs_.pc = resetVec | 1UL;       // Thumb
    regs_.lr = 0xFFFFFFFFUL;
    regs_.xpsr = 0x01000000UL;       // Thumb bit set, no active exception
    fpbDisableAll();
    dwtDisableAll();
    disableMonStep();
    clearFaults();
}

bool NrfGdbStubClass::memoryWritable(uint32_t address, uint32_t length) const {
    const uint64_t end = static_cast<uint64_t>(address) + static_cast<uint64_t>(length);
    if (end < address) {
        return false;
    }
    // Only RAM is writable directly. Flash patching would require NVMC erase
    // of a 4 KB page and is intentionally not supported here.
    return address >= ARM_SRAM_BASE && end <= ARM_SRAM_END;
}

bool NrfGdbStubClass::writeMemoryBytes(uint32_t address, const uint8_t *data, uint32_t length) {
    if (!memoryWritable(address, length)) {
        return false;
    }
    uint8_t *destination = reinterpret_cast<uint8_t *>(address);
    for (uint32_t index = 0UL; index < length; ++index) {
        destination[index] = data[index];
    }
    return true;
}

void NrfGdbStubClass::poll() {
    if (!enabled()) {
        return;
    }
    // CRITICAL: pump irqHandler(), not poll(). While the stub is halted it masks
    // the USBD NVIC IRQ, so the hardware ISR can't run. The host->device (OUT)
    // draining - EVENTS_EPDATA -> TASKS_STARTEPOUT -> EVENTS_ENDEPOUT -> rx ring -
    // lives ONLY in irqHandler(); poll() services device->host (IN) but never
    // drains OUT. Calling poll() alone meant GDB's RSP packets were never read
    // off the service CDC: the OUT endpoint stayed full, host writes stalled
    // ("semaphore timeout"), and GDB saw the connection close. Manually pumping
    // irqHandler() (safe precisely because the IRQ is masked) drains OUT so the
    // stub actually receives commands.
    nrfUsbdDriver().irqHandler();
    // This silicon doesn't signal a received OUT packet via EPDATASTATUS, so
    // the busy-poll can't wait for an event — speculatively drain the service
    // CDC OUT endpoint each poll to pick up GDB's RSP bytes.
    nrfUsbdDriver().drainServiceDataOut();
    // Brick-prevention: if the host opens the service CDC at 1200 bps while we
    // are halted (an upload's DFU touch), reboot to the bootloader. millis() is
    // frozen here, so the driver debounces this with a poll-iteration counter.
    nrfUsbdDriver().serviceHaltedTouch();
}

