dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
bool NrfGdbStubClass::enabled() const {
    const NrfSystemProfile &profile = nrfSystemProfile();
    return nrfUsbServicePortEnabled() && profile.debugTransport == NrfDebugTransport::UsbCdcGdbStub;
}

bool NrfGdbStubClass::active() const {
    return active_;
}

void NrfGdbStubClass::capture(uint32_t *stack, uint32_t excReturn, uint32_t exceptionNumber) {
    writeBreadcrumb(GDB_BREADCRUMB_CAPTURE);
    noAckMode_ = false;
    stackFrame_ = stack;
    regs_.r0 = stack[0];
    regs_.r1 = stack[1];
    regs_.r2 = stack[2];
    regs_.r3 = stack[3];
    regs_.r4 = nrf_gdb_stub_callee_regs[0];
    regs_.r5 = nrf_gdb_stub_callee_regs[1];
    regs_.r6 = nrf_gdb_stub_callee_regs[2];
    regs_.r7 = nrf_gdb_stub_callee_regs[3];
    regs_.r8 = nrf_gdb_stub_callee_regs[4];
    regs_.r9 = nrf_gdb_stub_callee_regs[5];
    regs_.r10 = nrf_gdb_stub_callee_regs[6];
    regs_.r11 = nrf_gdb_stub_callee_regs[7];
    regs_.r12 = stack[4];
    regs_.sp = reinterpret_cast<uint32_t>(stack + 8);
    regs_.lr = stack[5];
    regs_.pc = stack[6];
    regs_.xpsr = stack[7];
    excReturn_ = excReturn;
    exceptionNumber_ = exceptionNumber;
    signal_ = signalForException(exceptionNumber);
    // Classify why we stopped, for an accurate stop reply.
    if (pendingAsyncBreak_) {
        pendingAsyncBreak_ = false;
        signal_ = 2; // SIGINT -- host requested the halt (IDE 2 Pause).
    } else if (detectWatchpointHit()) {
        signal_ = 5; // SIGTRAP; sendStop() adds the watch:addr keyword.
    }
}

void NrfGdbStubClass::applyRegs() {
    if (stackFrame_ == nullptr) {
        return;
    }

    stackFrame_[0] = regs_.r0;
    stackFrame_[1] = regs_.r1;
    stackFrame_[2] = regs_.r2;
    stackFrame_[3] = regs_.r3;
    nrf_gdb_stub_callee_regs[0] = regs_.r4;
    nrf_gdb_stub_callee_regs[1] = regs_.r5;
    nrf_gdb_stub_callee_regs[2] = regs_.r6;
    nrf_gdb_stub_callee_regs[3] = regs_.r7;
    nrf_gdb_stub_callee_regs[4] = regs_.r8;
    nrf_gdb_stub_callee_regs[5] = regs_.r9;
    nrf_gdb_stub_callee_regs[6] = regs_.r10;
    nrf_gdb_stub_callee_regs[7] = regs_.r11;
    stackFrame_[4] = regs_.r12;
    stackFrame_[5] = regs_.lr;
    stackFrame_[6] = regs_.pc;
    stackFrame_[7] = regs_.xpsr;
}

void NrfGdbStubClass::clearFaults() {
    mem32(CFSR) = mem32(CFSR);
    mem32(HFSR) = mem32(HFSR);
    mem32(DFSR) = mem32(DFSR);
}

void NrfGdbStubClass::continueFrom(const char *packet) {
    if (packet != nullptr && packet[0] == 'c' && packet[1] != '\0') {
        bool ok = false;
        const uint32_t nextPc = parseHexWord(packet + 1, ok);
        if (ok) {
            regs_.pc = nextPc;
        }
    }

    if (packet != nullptr && packet[0] == 'c' && packet[1] == '\0') {
        const uint32_t bare = regs_.pc & ~1UL;
        const bool isFault = isFaultException(exceptionNumber_);
        // If we entered via a BKPT (DebugMon, exception 12), the PC sits ON
        // the BKPT instruction. Auto-advance past it on a plain `c` so the
        // target doesn't immediately re-trap. BKPT is the 16-bit Thumb
        // encoding 0xBE00..0xBEFF.
        bool isBkpt = false;
        if (memoryReadable(bare, 2UL)) {
            const uint16_t opcode = *reinterpret_cast<const uint16_t *>(bare);
            isBkpt = ((opcode & 0xFF00U) == 0xBE00U);
        }
        if (isFault || (exceptionNumber_ == 12UL && isBkpt)) {
            const uint32_t step = thumbInstructionSize(regs_.pc);
            regs_.pc = ((regs_.pc & ~1UL) + step) | (regs_.pc & 1UL);
        }
    }

    clearFaults();
    applyRegs();
    clearBreadcrumb();
}

void NrfGdbStubClass::sendPacket(const char *payload) {
    uint8_t checksum = 0U;
    while (nrfUsbdDriver().write('$') != 1U) {
        poll();
    }
    for (const char *cursor = payload; *cursor != '\0'; ++cursor) {
        checksum = static_cast<uint8_t>(checksum + static_cast<uint8_t>(*cursor));
        while (nrfUsbdDriver().write(static_cast<uint8_t>(*cursor)) != 1U) {
            poll();
        }
    }
    while (nrfUsbdDriver().write('#') != 1U) {
        poll();
    }
    while (nrfUsbdDriver().write(toHex(static_cast<uint8_t>(checksum >> 4U))) != 1U) {
        poll();
    }
    while (nrfUsbdDriver().write(toHex(static_cast<uint8_t>(checksum & 0x0FU))) != 1U) {
        poll();
    }
    nrfUsbdDriver().flush();
}

void NrfGdbStubClass::sendStop() {
    writeBreadcrumb(GDB_BREADCRUMB_STOP);
    char reply[32] = {0};
    size_t length = 0U;
    if (watchHit_) {
        // Watchpoint stop: gdb needs the T-packet keyword + data address (plain
        // big-endian hex) to attribute it to the right watchpoint.
        appendChar(reply, sizeof(reply), length, 'T');
        appendByte(reply, sizeof(reply), length, signal_);
        const char *keyword = (watchHitKind_ == 'w') ? "watch:"
                              : (watchHitKind_ == 'r') ? "rwatch:"
                                                       : "awatch:";
        appendText(reply, sizeof(reply), length, keyword);
        appendByte(reply, sizeof(reply), length, (watchHitAddr_ >> 24) & 0xFFU);
        appendByte(reply, sizeof(reply), length, (watchHitAddr_ >> 16) & 0xFFU);
        appendByte(reply, sizeof(reply), length, (watchHitAddr_ >> 8) & 0xFFU);
        appendByte(reply, sizeof(reply), length, watchHitAddr_ & 0xFFU);
        appendChar(reply, sizeof(reply), length, ';');
    } else {
        appendChar(reply, sizeof(reply), length, 'S');
        appendByte(reply, sizeof(reply), length, signal_);
    }
    sendPacket(reply);
}

bool NrfGdbStubClass::readPacket(char *packet, size_t capacity) {
    while (true) {
        // This is the indefinite idle spin while halted at a breakpoint waiting
        // for the next GDB byte. Keep any sketch-armed watchdog fed here, or it
        // would reset the board before the user even attaches.
        feedWatchdogIfRunning();
        poll();
        const int value = nrfUsbdDriver().read();
        if (value < 0) {
            continue;
        }
        writeBreadcrumb(GDB_BREADCRUMB_PACKET);
        if (value == '+') {
            continue;
        }
        if (value == 0x03) {
            packet[0] = '?';
            packet[1] = '\0';
            return true;
        }
        if (value != '$') {
            continue;
        }

        uint8_t checksum = 0U;
        size_t length = 0U;
        while (true) {
            poll();
            const int byteValue = nrfUsbdDriver().read();
            if (byteValue < 0) {
                continue;
            }
            if (byteValue == '#') {
                break;
            }
            checksum = static_cast<uint8_t>(checksum + static_cast<uint8_t>(byteValue));
            if (length + 1U < capacity) {
                packet[length++] = static_cast<char>(byteValue);
                packet[length] = '\0';
            }
        }

        int high = -1;
        int low = -1;
        while (high < 0) {
            poll();
            high = fromHex(nrfUsbdDriver().read());
        }
        while (low < 0) {
            poll();
            low = fromHex(nrfUsbdDriver().read());
        }

        const uint8_t remoteChecksum = static_cast<uint8_t>((high << 4U) | low);
        if (remoteChecksum != checksum) {
            while (nrfUsbdDriver().write('-') != 1U) {
                poll();
            }
            nrfUsbdDriver().flush();
            continue;
        }

        if (!noAckMode_) {
            while (nrfUsbdDriver().write('+') != 1U) {
                poll();
            }
            nrfUsbdDriver().flush();
        }
        return true;
    }
}

void NrfGdbStubClass::reply(char *packet, char *response, size_t capacity) {
    writeBreadcrumb(GDB_BREADCRUMB_REPLY);
    response[0] = '\0';
    size_t length = 0U;

    if (packet[0] == '?') {
        appendChar(response, capacity, length, 'S');
        appendByte(response, capacity, length, signal_);
        return;
    }

    if (packet[0] == 'q') {
        if (strncmp(packet, "qSupported", 10) == 0) {
            // Larger packet size lets gdb pull register dumps in one round trip;
            // hwbreak+ tells gdb our Z0 is satisfied by hardware (FPB) so it
            // won't fall back to writing BKPT into flash.
            appendText(response, capacity, length,
                       "PacketSize=200;swbreak+;hwbreak+;vContSupported+;QStartNoAckMode+");
            return;
        }
        if (strcmp(packet, "qAttached") == 0) {
            appendText(response, capacity, length, "1");
            return;
        }
        if (strcmp(packet, "qTStatus") == 0) {
            return;
        }
        if (strcmp(packet, "qfThreadInfo") == 0) {
            appendText(response, capacity, length, "m1");
            return;
        }
        if (strcmp(packet, "qsThreadInfo") == 0) {
            appendText(response, capacity, length, "l");
            return;
        }
        // qRcmd,<hex> — gdb "monitor" command. cortex-debug's Restart issues
        // "reset"/"reset halt" here; honor any command containing "reset" as a
        // warm restart (re-point SP/PC at the reset vector) and stay halted.
        if (strncmp(packet, "qRcmd,", 6) == 0) {
            char decoded[40] = {0};
            size_t out = 0U;
            for (const char *cursor = packet + 6;
                 cursor[0] != '\0' && cursor[1] != '\0' && out + 1U < sizeof(decoded);
                 cursor += 2) {
                const int high = fromHex(cursor[0]);
                const int low = fromHex(cursor[1]);
                if (high < 0 || low < 0) {
                    break;
                }
                decoded[out++] = static_cast<char>((high << 4) | low);
            }
            decoded[out] = '\0';
            if (strstr(decoded, "reset") != nullptr) {
                performWarmRestart();
            }
            appendText(response, capacity, length, "OK");
            return;
        }
        return;
    }

    if (packet[0] == 'H') {
        appendText(response, capacity, length, "OK");
        return;
    }

    if (strcmp(packet, "vCont?") == 0) {
        appendText(response, capacity, length, "vCont;c;C;s;S");
        return;
    }

    if (strcmp(packet, "vMustReplyEmpty") == 0) {
        return;
    }

