dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
    if (strcmp(packet, "!") == 0) {
        appendText(response, capacity, length, "OK");
        return;
    }

    if (strcmp(packet, "QStartNoAckMode") == 0) {
        appendText(response, capacity, length, "OK");
        noAckMode_ = true;
        return;
    }

    if (packet[0] == 'g') {
        appendWord(response, capacity, length, regs_.r0);
        appendWord(response, capacity, length, regs_.r1);
        appendWord(response, capacity, length, regs_.r2);
        appendWord(response, capacity, length, regs_.r3);
        appendWord(response, capacity, length, regs_.r4);
        appendWord(response, capacity, length, regs_.r5);
        appendWord(response, capacity, length, regs_.r6);
        appendWord(response, capacity, length, regs_.r7);
        appendWord(response, capacity, length, regs_.r8);
        appendWord(response, capacity, length, regs_.r9);
        appendWord(response, capacity, length, regs_.r10);
        appendWord(response, capacity, length, regs_.r11);
        appendWord(response, capacity, length, regs_.r12);
        appendWord(response, capacity, length, regs_.sp);
        appendWord(response, capacity, length, regs_.lr);
        appendWord(response, capacity, length, regs_.pc);
        appendWord(response, capacity, length, regs_.xpsr);
        return;
    }

    if (packet[0] == 'p') {
        char *equals = strchr(packet + 1, '=');
        if (equals != nullptr) {
            *equals = '\0';
            bool ok = false;
            const uint32_t index = parseHexWord(packet + 1, ok);
            uint32_t value = 0UL;
            if (!ok || !parseRegisterBytes(equals + 1, value) || !setRegByIndex(regs_, index, value)) {
                appendText(response, capacity, length, "E01");
                return;
            }
            appendText(response, capacity, length, "OK");
            return;
        }

        bool ok = false;
        const uint32_t index = parseHexWord(packet + 1, ok);
        const uint32_t *reg = nullptr;
        if (ok) {
            reg = regByIndex(regs_, index);
        }
        if (reg == nullptr) {
            appendText(response, capacity, length, "E01");
            return;
        }
        appendWord(response, capacity, length, *reg);
        return;
    }

    if (packet[0] == 'G') {
        const char *cursor = packet + 1;
        uint32_t value = 0UL;
        for (uint32_t index = 0UL; index <= 15UL; ++index) {
            if (!parseRegisterBytes(cursor, value) || !setRegByIndex(regs_, index, value)) {
                appendText(response, capacity, length, "E01");
                return;
            }
            cursor += 8;
        }
        if (!parseRegisterBytes(cursor, value) || !setRegByIndex(regs_, 25UL, value)) {
            appendText(response, capacity, length, "E01");
            return;
        }
        appendText(response, capacity, length, "OK");
        return;
    }

    if (packet[0] == 'm') {
        uint32_t address = 0UL;
        uint32_t requestLength = 0UL;
        if (!splitMemoryRequest(packet + 1, address, requestLength) || requestLength > 96UL || !memoryReadable(address, requestLength)) {
            appendText(response, capacity, length, "E01");
            return;
        }

        const uint8_t *bytes = reinterpret_cast<const uint8_t *>(address);
        for (uint32_t index = 0UL; index < requestLength; ++index) {
            appendByte(response, capacity, length, bytes[index]);
        }
        return;
    }

    // M addr,length:bytes — write `length` bytes (hex-encoded) to RAM at `addr`.
    // Refused for flash because we don't perform NVMC operations from the stub.
    if (packet[0] == 'M') {
        char *colon = strchr(packet + 1, ':');
        if (colon == nullptr) {
            appendText(response, capacity, length, "E01");
            return;
        }
        *colon = '\0';
        uint32_t address = 0UL;
        uint32_t writeLength = 0UL;
        if (!splitMemoryRequest(packet + 1, address, writeLength)) {
            appendText(response, capacity, length, "E01");
            return;
        }
        if (writeLength == 0UL) {
            appendText(response, capacity, length, "OK");
            return;
        }

        const char *cursor = colon + 1;
        // Decode in place into a stack buffer; cap matches our packet size.
        uint8_t bytes[96];
        if (writeLength > sizeof(bytes)) {
            appendText(response, capacity, length, "E02");
            return;
        }
        for (uint32_t index = 0UL; index < writeLength; ++index) {
            const int high = fromHex(cursor[index * 2U]);
            const int low = fromHex(cursor[index * 2U + 1U]);
            if (high < 0 || low < 0) {
                appendText(response, capacity, length, "E01");
                return;
            }
            bytes[index] = static_cast<uint8_t>((high << 4U) | low);
        }
        if (!writeMemoryBytes(address, bytes, writeLength)) {
            appendText(response, capacity, length, "E03");
            return;
        }
        appendText(response, capacity, length, "OK");
        return;
    }

    // ZN,addr,kind / zN,addr,kind — breakpoint/watchpoint insert / remove.
    //   Z0/Z1 -> code breakpoint via FPB (max 6); Z1 aliased to FPB.
    //   Z2/Z3/Z4 -> data write/read/access watchpoint via DWT (max 4); `kind`
    //   is the watch length in bytes.
    if (packet[0] == 'Z' || packet[0] == 'z') {
        const bool insert = (packet[0] == 'Z');
        const char type = packet[1];
        if ((type < '0' || type > '4') || packet[2] != ',') {
            return; // Unsupported type → empty reply lets gdb fall back.
        }
        char *afterAddr = strchr(packet + 3, ',');
        if (afterAddr == nullptr) {
            appendText(response, capacity, length, "E01");
            return;
        }
        *afterAddr = '\0';
        bool ok = false;
        const uint32_t address = parseHexWord(packet + 3, ok);
        if (!ok) {
            appendText(response, capacity, length, "E01");
            return;
        }

        if (type == '0' || type == '1') {
            const bool result = insert ? fpbInsert(address) : fpbRemove(address);
            appendText(response, capacity, length, result ? "OK" : "E02");
            return;
        }

        // Watchpoint. Parse the length (kind) after the second comma.
        bool kindOk = false;
        const uint32_t kind = parseHexWord(afterAddr + 1, kindOk);
        const uint32_t fn = (type == '2') ? 6UL    // write
                            : (type == '3') ? 5UL   // read
                                            : 7UL;  // '4' = access
        const bool result = insert ? dwtInsert(fn, address, kindOk ? kind : 4UL)
                                    : dwtRemove(fn, address);
        appendText(response, capacity, length, result ? "OK" : "E02");
        return;
    }

    if (packet[0] == 'D') {
        // GDB detach: drop all breakpoints/watchpoints so the program runs
        // cleanly afterwards, and disarm async-break.
        fpbDisableAll();
        dwtDisableAll();
        disableMonStep();
        sessionLive_ = false;
        appendText(response, capacity, length, "OK");
        return;
    }
}

