dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfGdbStub.cpp
void NrfGdbStubClass::serve() {
    writeBreadcrumb(GDB_BREADCRUMB_SERVE);
    nrfUsbdResetPollTrace();
    char packet[PACKET_CAPACITY] = {0};
    char response[REPLY_CAPACITY] = {0};

    while (!USBDevice.connected()) {
        feedWatchdogIfRunning();
        poll();
    }

    while (true) {
        // Halted at a breakpoint or between GDB packets: keep any sketch-armed
        // watchdog alive so the debug session isn't reset out from under us.
        feedWatchdogIfRunning();

        if (stopPending_) {
            // Only send the stop reply if gdb resumed us and is waiting for it.
            // On initial attach gdb expects to drive (qSupported/?/...), so an
            // unsolicited stop would desync the whole session.
            if (expectStopReply_) {
                sendStop();
            }
            stopPending_ = false;
            expectStopReply_ = false;
        }

        if (!readPacket(packet, sizeof(packet))) {
            continue;
        }

        // Continue without stepping: c, c<addr>, vCont;c
        if (packet[0] == 'c' || strncmp(packet, "vCont;c", 7) == 0) {
            disableMonStep();
            expectStopReply_ = true; // gdb will block waiting for the next stop
            sessionLive_ = true;     // arm async-break (Pause) while we run free
            continueFrom(packet);
            active_ = false;
            return;
        }

        // Single step: s, s<addr>, vCont;s, vCont;S<sig>
        // Arming MON_STEP causes DebugMon to re-fire after exactly one
        // instruction once we return from this exception.
        if (packet[0] == 's' || strncmp(packet, "vCont;s", 7) == 0 ||
            strncmp(packet, "vCont;S", 7) == 0) {
            enableMonStep();
            // Mask application interrupts (SysTick/RTC1/...) for the duration of
            // the single instruction so the step lands on the next user
            // instruction instead of diving into a pending ISR. DebugMon is
            // pinned to priority 0 so it still fires to end the step. Cleared on
            // the next DebugMon entry (top of handleException).
            setBasepri(STEP_BASEPRI);
            expectStopReply_ = true; // gdb blocks waiting for the post-step stop
            sessionLive_ = true;     // a live session: keep async-break armed
            // Pass plain 'c' so continueFrom does the register write-back
            // without trying to skip a faulting instruction.
            char nudge[2] = {'c', '\0'};
            continueFrom(nudge);
            active_ = false;
            return;
        }

        reply(packet, response, sizeof(response));
        sendPacket(response);

        if (packet[0] == 'D') {
            clearFaults();
            active_ = false;
            nrfUsbdClearPollTrace();
            clearBreadcrumb();
            return;
        }
    }
}

void NrfGdbStubClass::handleException(uint32_t *stack, uint32_t excReturn, uint32_t exceptionNumber) {
    if (!enabled()) {
        while (true) {
        }
    }

    writeBreadcrumb(GDB_BREADCRUMB_EXCEPTION);
    init();
    // Drop any step-time interrupt mask raised on the previous resume so the
    // stub loop (and any subsequent `continue`) runs with interrupts at their
    // normal levels.
    setBasepri(0);
    // Mask USBD in NVIC for the duration of the stub session. The peripheral
    // events still latch in EVENTS_*; our explicit poll() services them, so
    // this prevents the ISR from racing the busy-loop reads/writes below.
    usbIrqWasEnabled_ = (mem32(NVIC_ISER_BASE + USBD_NVIC_REG_OFFSET) & USBD_NVIC_BIT) != 0UL;
    if (usbIrqWasEnabled_) {
        mem32(NVIC_ICER_BASE + USBD_NVIC_REG_OFFSET) = USBD_NVIC_BIT;
    }
    // Arm the millis-free 1200-bps touch watchdog so a halted board stays
    // reflashable: an upload can always reboot us into the bootloader.
    nrfUsbdDriver().setStubHalted(true);
    capture(stack, excReturn, exceptionNumber);
    active_ = true;
    stopPending_ = true;
    serve();
    nrfUsbdDriver().setStubHalted(false);
    if (usbIrqWasEnabled_) {
        mem32(NVIC_ISER_BASE + USBD_NVIC_REG_OFFSET) = USBD_NVIC_BIT;
    }
}

extern "C" void nrfGdbStubHandleExceptionC(uint32_t *stack, uint32_t excReturn, uint32_t exceptionNumber) {
    nrfGdbStub().handleException(stack, excReturn, exceptionNumber);
}

#if defined(NRF_SYSTEM_USB_GDB_STUB) && (NRF_SYSTEM_USB_GDB_STUB == 1)
extern "C" __attribute__((naked)) void HardFault_Handler(void) {
    __asm__ volatile(
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "stmia r3!, {r4-r7}\n"
        "mov r4, r8\n"
        "mov r5, r9\n"
        "mov r6, r10\n"
        "mov r7, r11\n"
        "stmia r3!, {r4-r7}\n"
        "tst lr, #4\n"
        "ite eq\n"
        "mrseq r0, msp\n"
        "mrsne r0, psp\n"
        "mov r3, lr\n"
        // Preserve EXC_RETURN across the bl. push {r3,r4} stored it in the LOW
        // slot, but pop {r4,lr} restores lr from the HIGH slot -> lr came back
        // as a garbage callee reg and bx lr faulted (INVSTATE) on resume. lr is
        // still EXC_RETURN here (only the bl clobbers it), so push it directly.
        "push {r3, lr}\n"
        "mov r1, lr\n"
        "movs r2, #3\n"
        "bl nrfGdbStubHandleExceptionC\n"
        "pop {r4, lr}\n"
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "ldmia r3!, {r4-r7}\n"
        "ldr r0, [r3]\n"
        "ldr r1, [r3, #4]\n"
        "ldr r2, [r3, #8]\n"
        "ldr r3, [r3, #12]\n"
        "mov r8, r0\n"
        "mov r9, r1\n"
        "mov r10, r2\n"
        "mov r11, r3\n"
        "bx lr\n");
}

extern "C" __attribute__((naked)) void MemManage_Handler(void) {
    __asm__ volatile(
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "stmia r3!, {r4-r7}\n"
        "mov r4, r8\n"
        "mov r5, r9\n"
        "mov r6, r10\n"
        "mov r7, r11\n"
        "stmia r3!, {r4-r7}\n"
        "tst lr, #4\n"
        "ite eq\n"
        "mrseq r0, msp\n"
        "mrsne r0, psp\n"
        "mov r3, lr\n"
        // Preserve EXC_RETURN across the bl. push {r3,r4} stored it in the LOW
        // slot, but pop {r4,lr} restores lr from the HIGH slot -> lr came back
        // as a garbage callee reg and bx lr faulted (INVSTATE) on resume. lr is
        // still EXC_RETURN here (only the bl clobbers it), so push it directly.
        "push {r3, lr}\n"
        "mov r1, lr\n"
        "movs r2, #4\n"
        "bl nrfGdbStubHandleExceptionC\n"
        "pop {r4, lr}\n"
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "ldmia r3!, {r4-r7}\n"
        "ldr r0, [r3]\n"
        "ldr r1, [r3, #4]\n"
        "ldr r2, [r3, #8]\n"
        "ldr r3, [r3, #12]\n"
        "mov r8, r0\n"
        "mov r9, r1\n"
        "mov r10, r2\n"
        "mov r11, r3\n"
        "bx lr\n");
}

extern "C" __attribute__((naked)) void BusFault_Handler(void) {
    __asm__ volatile(
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "stmia r3!, {r4-r7}\n"
        "mov r4, r8\n"
        "mov r5, r9\n"
        "mov r6, r10\n"
        "mov r7, r11\n"
        "stmia r3!, {r4-r7}\n"
        "tst lr, #4\n"
        "ite eq\n"
        "mrseq r0, msp\n"
        "mrsne r0, psp\n"
        "mov r3, lr\n"
        // Preserve EXC_RETURN across the bl. push {r3,r4} stored it in the LOW
        // slot, but pop {r4,lr} restores lr from the HIGH slot -> lr came back
        // as a garbage callee reg and bx lr faulted (INVSTATE) on resume. lr is
        // still EXC_RETURN here (only the bl clobbers it), so push it directly.
        "push {r3, lr}\n"
        "mov r1, lr\n"
        "movs r2, #5\n"
        "bl nrfGdbStubHandleExceptionC\n"
        "pop {r4, lr}\n"
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "ldmia r3!, {r4-r7}\n"
        "ldr r0, [r3]\n"
        "ldr r1, [r3, #4]\n"
        "ldr r2, [r3, #8]\n"
        "ldr r3, [r3, #12]\n"
        "mov r8, r0\n"
        "mov r9, r1\n"
        "mov r10, r2\n"
        "mov r11, r3\n"
        "bx lr\n");
}

extern "C" __attribute__((naked)) void UsageFault_Handler(void) {
    __asm__ volatile(
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "stmia r3!, {r4-r7}\n"
        "mov r4, r8\n"
        "mov r5, r9\n"
        "mov r6, r10\n"
        "mov r7, r11\n"
        "stmia r3!, {r4-r7}\n"
        "tst lr, #4\n"
        "ite eq\n"
        "mrseq r0, msp\n"
        "mrsne r0, psp\n"
        "mov r3, lr\n"
        // Preserve EXC_RETURN across the bl. push {r3,r4} stored it in the LOW
        // slot, but pop {r4,lr} restores lr from the HIGH slot -> lr came back
        // as a garbage callee reg and bx lr faulted (INVSTATE) on resume. lr is
        // still EXC_RETURN here (only the bl clobbers it), so push it directly.
        "push {r3, lr}\n"
        "mov r1, lr\n"
        "movs r2, #6\n"
        "bl nrfGdbStubHandleExceptionC\n"
        "pop {r4, lr}\n"
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "ldmia r3!, {r4-r7}\n"
        "ldr r0, [r3]\n"
        "ldr r1, [r3, #4]\n"
        "ldr r2, [r3, #8]\n"
        "ldr r3, [r3, #12]\n"
        "mov r8, r0\n"
        "mov r9, r1\n"
        "mov r10, r2\n"
        "mov r11, r3\n"
        "bx lr\n");
}

extern "C" __attribute__((naked)) void DebugMon_Handler(void) {
    __asm__ volatile(
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "stmia r3!, {r4-r7}\n"
        "mov r4, r8\n"
        "mov r5, r9\n"
        "mov r6, r10\n"
        "mov r7, r11\n"
        "stmia r3!, {r4-r7}\n"
        "tst lr, #4\n"
        "ite eq\n"
        "mrseq r0, msp\n"
        "mrsne r0, psp\n"
        "mov r3, lr\n"
        // Preserve EXC_RETURN across the bl. push {r3,r4} stored it in the LOW
        // slot, but pop {r4,lr} restores lr from the HIGH slot -> lr came back
        // as a garbage callee reg and bx lr faulted (INVSTATE) on resume. lr is
        // still EXC_RETURN here (only the bl clobbers it), so push it directly.
        "push {r3, lr}\n"
        "mov r1, lr\n"
        "movs r2, #12\n"
        "bl nrfGdbStubHandleExceptionC\n"
        "pop {r4, lr}\n"
        "ldr r3, =nrf_gdb_stub_callee_regs\n"
        "ldmia r3!, {r4-r7}\n"
        "ldr r0, [r3]\n"
        "ldr r1, [r3, #4]\n"
        "ldr r2, [r3, #8]\n"
        "ldr r3, [r3, #12]\n"
        "mov r8, r0\n"
        "mov r9, r1\n"
        "mov r10, r2\n"
        "mov r11, r3\n"
        "bx lr\n");
}
#endif
